<?php

use Core\Container;
use Core\Database\DB;

/**
 * -----------------------------------------------------------------------------
 * Регистрация сервиса подключения к базе данных.
 * -----------------------------------------------------------------------------
 * Определяет singleton-экземпляр {@see Core\Database\DB} в DI-контейнере.
 *
 * ---------------------------------------------------------------------------
 * Пример использования:
 * ---------------------------------------------------------------------------
 * ```php
 * use Core\Database\DB;
 *  
 * $id = 1;
 * $db = $container->get(DB::class);
 * $sql = 'SELECT * FROM `users` WHERE `id` = ' . $this->db->quoteInt($id);
 * $reuslt = $this->db->getRow($sql);
 * ```
 *
 * @package config\services
 *
 * @param Container $container Контейнер внедрения зависимостей.
 *
 * @return void
 */
return function (Container $container): void {
    /**
     * ------------------------------------------------------------
     * Добавление singleton-сервиса DB.
     * ------------------------------------------------------------
     * Сервис регистрируется с использованием ленивой инициализации:
     * экземпляр {@see Core\Database\DB} создаётся только при первом вызове.
     * 
     * Метод {@see DB::getInstance()} использует трейд {@see Core\Traits\TSingleton},
     * обеспечивая единый объект соединения с базой данных в рамках
     * жизненного цикла приложения и возможность статического обращения:
     * `DB::getInstance()->method($id);`.
     */
    $container->singleton(DB::class, fn() => DB::getInstance());
};