<?php
/**
 * --------------------------------------------------------------------------
 * Конфигурация приложения.
 * --------------------------------------------------------------------------
 */
return [
    /**
     * Режим отладки приложения.
     * 
     * 0 - отключен (production-режим)
     * 1 - включен (разработка) — вывод ошибок, стектрейсов и отладочной информации
     */
    'debug' => 0,

    /**
     * Режим отладки SQL-запросов.
     * 
     * 0 - отключен
     * 1 - включен — логирование всех SQL-запросов.
     */
    'debug_sql' => 0,

    /**
     * Настройки пагинации (постраничной навигации).
     */
    'pagination' => [
        'per_page' => 6,
    ],

    /**
     * Уникальные просмотры в рамках сессии.
     */
    'articles' => [
        'unique_views_in_session' => false,
    ],

    'scss' => [
        'dev_mode' => false,
    ],

    'smarty' => [
        'caching' => false,
        'compile_check' => true,
        'force_compile' => false,
    ],
];