<?php
/**
 * --------------------------------------------------------------------------
 * Конфигурация подключения к базе данных.
 * --------------------------------------------------------------------------
 */
return [
    'connections' => [
        'mysql' => [
            'host' => '',
            'port' => 3306,
            'database' => '',
            'username' => '',
            'password' => '',
            'charset' => 'utf8mb4',
            'collation' => '',
            'prefix' => ''
        ]
    ]
];