<?php
/**
 * --------------------------------------------------------------------------
 * Конфигурация подключения к базе данных.
 * --------------------------------------------------------------------------
 */
return [
    'connections' => [
        'mysql' => [
            'host' => 'mysql',
            'port' => 3306,
            'database' => 'project',
            'username' => 'app',
            'password' => 'secret',
            'charset' => 'utf8mb4',
            'collation' => '',
            'prefix' => ''
        ]
    ]
];